In [81]:
import numpy as np
import pandas as pd

In [82]:
dic2 = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [83]:
df2= pd.DataFrame(dic2)

In [84]:
df2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [85]:
df2.dropna()   #### drops all the rows with the na value. If you want to drop columns then put axis =1

     A    B  C
0  1.0  5.0  1

In [86]:
df2.dropna(axis=1)  # you can also use thresh value to say how many values of NA

   C
0  1
1  2
2  3

In [87]:
## FILL in NA values
df2['A'] = df2.fillna(value=df2['A'].mean())

In [88]:
df2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [89]:
data = {'Company':["GOOG","GOOG", "MSFT", "MSFT" ,"FB" ,"FB"],
        'Person':["sam", " charlie" , "amy" , "vanessa", "carl" , "sarah"] , 
        'Sales':[200 , 120 ,340, 124, 243, 350]}

In [90]:
df= pd.DataFrame(data)

In [91]:
df

  Company    Person  Sales
0    GOOG       sam    200
1    GOOG   charlie    120
2    MSFT       amy    340
3    MSFT   vanessa    124
4      FB      carl    243
5      FB     sarah    350

In [92]:
df.groupby('Company')

In [93]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [94]:
df.groupby('Company').sum().loc['GOOG']  ## USE DESCRIBEMETHOD() OR MIN() MAX()

Sales    320
Name: GOOG, dtype: int64

In [95]:
dfa = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
dfb = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
dfc = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [96]:
dfc

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [97]:
pd.concat([dfa,dfb,dfc])   #### data concated. add rows to eachother

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [98]:
dfc['key']= ['K0','K1','K2','K3']

In [99]:
dfc

      A    B    C    D key
8    A8   B8   C8   D8  K0
9    A9   B9   C9   D9  K1
10  A10  B10  C10  D10  K2
11  A11  B11  C11  D11  K3

In [100]:
dfb['key']= ['K0','K1','K2','K3']

In [101]:
dfb

    A   B   C   D key
4  A4  B4  C4  D4  K0
5  A5  B5  C5  D5  K1
6  A6  B6  C6  D6  K2
7  A7  B7  C7  D7  K3

In [103]:
## lets merge them with key column we will join dfb and dfc by column key ## you can also jpin with 2 keys or multiple keys
pd.merge(dfc,dfb,how='inner',on='key')

   A_x  B_x  C_x  D_x key A_y B_y C_y D_y
0   A8   B8   C8   D8  K0  A4  B4  C4  D4
1   A9   B9   C9   D9  K1  A5  B5  C5  D5
2  A10  B10  C10  D10  K2  A6  B6  C6  D6
3  A11  B11  C11  D11  K3  A7  B7  C7  D7